<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5fc0a5306cd037a451d4efd32116e17db009ae106aa25b07bc62db3ad2104119","plan_job_ref":"Job .github/workflows/_test-tf.yaml #56 at https://github.com/DND-IT/github-workflows/actions/runs/15378593844","plan_out_hash":"a02956b25d7d45dcf4997601d4368c4448f6f1aa57849542db304cea2473b56a","plan_hash":"ebc6bf238b021bac686d7b5f437a62c84b7a01a5b9b82cdf334c15aa6e82f75a","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #56](https://github.com/DND-IT/github-workflows/actions/runs/15378593844)